[{"strength": ["1500/1600"], "ptype": ["SPECIAL EVENTS"], "place": ["R. R. Avenue."], "details": ["Demonstration by an Organisation at R. R. Avenue followed by special program against issues related to physically challenged persons."], "time": ["12:00"], "date": ["03/12/2014"]},
{"strength": ["1400/1500"], "ptype": ["PROCESSION"], "place": ["Rabindra Sadan."], "details": ["A procession will be organised by an Organisation in observance of the International Day of Disabilities - 2014. It will start from Rabindra Sadan and move through A. J. C. Bose Road, Exide crossing, Lord Sinha Road, Shakespeare Sarani, Cathedral Road and back to the point of origin."], "time": ["12:30"], "date": ["03/12/2014"]},
{"strength": ["200/250"], "ptype": ["SPECIAL EVENTS"], "place": ["R. S. M. Square."], "details": ["Meeting and special events will be organised by a Political Organisation at R. S. M. Square. "], "time": ["13:00"], "date": ["02/12/2014"]},
{"strength": ["Good Number."], "ptype": ["PROCESSION"], "place": ["College Square."], "details": ["A Procession will be organised by a Political Organisation from College Square to Dharmatala via College Street, N. C. Street, R. A. Kidwai Road and S. N. Banerjee Road."], "time": ["13:30"], "date": ["02/12/2014"]},
{"strength": ["2200"], "ptype": ["PROCESSION"], "place": ["Dharmatala."], "details": ["A procession will be organised by a Political Organisation from Dharmatala to College Square via Lenin Sarani, Wellington Square, N. C. Street and College Street. Earlier processions will come from Ramlila Maidan, Shyambazar 5 point, Khidderpur crossing etc. to Dharmatala."], "time": ["17:00"], "date": ["02/12/2014"]},
{"strength": ["20000/25000"], "ptype": ["MEETING"], "place": ["Sahid Minar Maidan."], "details": ["Mass meeting by an Political Organisation at Sahid Minar Maidan regarding various issues. Earlier processions will come from Howrah, Sealdah Railway Stations and from South, North Kolkata."], "time": ["13:00"], "date": ["01/12/2014"]},
{"strength": ["550-600"], "ptype": ["PROCESSION"], "place": ["The Metropolitan Institute, 39 Sankar Ghosh Lane"], "details": ["Procession from The Metropolitan Institute, 39 Sankar Ghosh Lane via Guruprasad Chowdhury Lane, Bechu Chatterjee Street, Bidhan Sarani and terminate at Star Theatre by an organisation."], "time": ["09:00"], "date": ["29/11/2014"]},
{"strength": ["75000-100000"], "ptype": ["MEETING"], "place": ["Sahid Minar Maidan."], "details": ["Meeting at Sahid Minar Maidan by an organisation. Earlier processions will come from Howrah and Sealdah Railway Station, Park Circus Railway Station, Zakaria Street, Nakhoda Mosque, Rajabazar crossing, Kidderpore More, Park Circus Maidan, Chandpal Ghat etc."], "time": ["12:00"], "date": ["29/11/2014"]},
{"strength": ["200"], "ptype": ["PROCESSION"], "place": ["Roy Math near 14 No Bus Stand."], "details": ["Procession from Roy Math near 14 No Bus Stand and will move through the Crossing of J L Sarani and Roy Bahadur Road, Taratala crossing, Diamond Park, J L Sarani, Roy Bahadur Road, Jyotish Roy Road and terminate at Bhatikhana crossing by an organisation."], "time": ["15:00"], "date": ["29/11/2014"]},
{"strength": ["200"], "ptype": ["PROCESSION"], "place": ["Subodh Mullick Square."], "details": ["Procession from Subodh Mullick Square to Alimuddin street via R A Kidwai Road by an organisation."], "time": ["16:00"], "date": ["29/11/2014"]}]